{
  "-Ns-AmjcpwEE-rprWsn_": {
    "firebaseKey": "-Ns-AmjcpwEE-rprWsn_",
    "title": "JS",
    "definition": "often abbreviated as JS, is a programming language and core technology of the World Wide Web, alongside HTML and CSS. As of 2024, 98.8% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices.",
    "timeSubmitted": "2023-07-17 08:12:00",
    "uid": "MjLYOFnhvbZHtBDQHnKCa4hnIN43",
    "language_id": null
  },
  "-Ns-AmjeiiE4cbumh4wq": {
    "firebaseKey": "-Ns-AmjeiiE4cbumh4wq",
    "title": "Python",
    "definition": "A high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation.  Python is dynamically typed and garbage-collected. It supports multiple programming paradigms, including structured (particularly procedural), object-oriented and functional programming. It is often described as a 'batteries included' language due to its comprehensive standard library.",
    "timeSubmitted": "2023-05-11 18:26:44",
    "uid": "MjLYOFnhvbZHtBDQHnKCa4hnIN43",
    "language_id": null
  },
  "-Ns-AmjfzgQLKD9JyHbH": {
    "firebaseKey": "-Ns-AmjfzgQLKD9JyHbH",
    "title": "C#",
    "definition": "A general-purpose high-level programming language supporting multiple paradigms. C# encompasses static typing, strong typing, lexically scoped, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines",
    "timeSubmitted": "2023-04-15 06:00:52",
    "uid": "MjLYOFnhvbZHtBDQHnKCa4hnIN43",
    "language_id": null
  },
  "-Ns-AmjgReHliZyCWNoN": {
    "firebaseKey": "-Ns-AmjgReHliZyCWNoN",
    "title": "SQL",
    "definition": "SQL is a standard database query language. It is used to access and manipulate data in databases. SQL is a declarative language that specifies the desired results, but not the steps to achieve those results. SQL is a powerful tool for accessing and manipulating data, and it is the world's most widely used database query language.",
    "timeSubmitted": "2023-06-20 09:12:48",
    "uid": "MjLYOFnhvbZHtBDQHnKCa4hnIN43",
    "language_id": null
  },
  "-Ns-AmjieqQK0b2uS-_P": {
    "firebaseKey": "-Ns-AmjieqQK0b2uS-_P",
    "title": "C++",
    "definition": "An object-oriented programming language which gives a clear structure to programs and allows code to be reused, lowering development costs. C++ is portable and can be used to develop applications that can be adapted to multiple platforms.",
    "timeSubmitted": "2024-01-29 00:18:31",
    "uid": "MjLYOFnhvbZHtBDQHnKCa4hnIN43",
    "language_id": null
  },
  "-Ns-Amjj4Q1Kq56F1rmW": {
    "firebaseKey": "-Ns-Amjj4Q1Kq56F1rmW",
    "title": "Swift",
    "definition": "An open-source programming language that is easy to learn, Swift supports almost everything from the programming language Objective-C. Swift requires fewer coding skills compared with other programming languages, and it can be used with IBM Swift Sandbox and IBM Bluemix. ",
    "timeSubmitted": "2023-08-24 10:43:42",
    "uid": "MjLYOFnhvbZHtBDQHnKCa4hnIN43",
    "language_id": null
  },
  "-Ns-Amjky2ptI4Kx92nL": {
    "firebaseKey": "-Ns-Amjky2ptI4Kx92nL",
    "title": "Perl, 2nd account",
    "definition": "The language is dynamic with innovative features that make it popular and different from what is available on Linux and Windows Server. Websites with high traffic usually use Perl, including IMDB, as it helps in text manipulation tasks.",
    "timeSubmitted": "2024-02-29 08:31:29",
    "uid": "OL4mnRmgSHceyYX79WHJoMZrvlV2",
    "language_id": null
  },
  "-Ns-Amjl8cJQ9pcd8sF7": {
    "firebaseKey": "-Ns-Amjl8cJQ9pcd8sF7",
    "title": "HTML, 2nd account",
    "definition": "The standard language for creating web pages and applications. HTML is used to create web pages. You can use HTML to add images, links, and other types of content to your web page. HTML is a simple programming language; you don't need to know much about it to create a basic web page.",
    "timeSubmitted": "2023-03-09 00:27:34",
    "uid": "OL4mnRmgSHceyYX79WHJoMZrvlV2",
    "language_id": null
  },
  "-Ns-Amjm0oTTJ5156WUA": {
    "firebaseKey": "-Ns-Amjm0oTTJ5156WUA",
    "title": "This should not be seen",
    "definition": "Something is wrong if you see this",
    "timeSubmitted": "2023-10-24 02:14:15",
    "uid": "",
    "language_id": null
  },
  "-Ns-Amjo_q7rp4sYLX9x": {
    "firebaseKey": "-Ns-Amjo_q7rp4sYLX9x",
    "title": "Rust, 2nd account",
    "definition": "A programming language designed to be safe, concurrent, and practical. It is a systems programming language that runs blazingly fast, prevents segfaults, and guarantees thread safety. Rust is also memory-efficient: it uses minimal memory, making it ideal for embedded systems.",
    "timeSubmitted": "2023-11-23 19:41:21",
    "uid": "OL4mnRmgSHceyYX79WHJoMZrvlV2",
    "language_id": null
  }
}
